

LOCATION_CODE = {
    ('广东省', '深圳市', '罗湖区', '流塘路', '罗湖物流集散区',) : 1,
    ('广东省', '深圳市', '龙岗区', '龙华民康路', '华南国际物流中心',) : 2,
    ('广东省', '深圳市', '福田区', '市花路9号', '泰福物流',) : 3,
    ('广东省', '深圳市', '龙岗区', '沙平北路', '金鹏物流园',) : 4,
    ('广东省', '深圳市', '盐田区', '盐田街道明珠东南方向', '腾邦物流园',) : 5,
    ('广东省', '深圳市', '宝安区', '松岗街道罗田社区', '远辉物理园',) : 6,
    ('广东省', '深圳市', '宝安区', '石岩街道塘头社区', '宏源发石岩物流园',) : 7,
    ('广西省', '南宁市', '江南区', '江南街道五一中路', '天马物流',) : 8,
    ('广东省', '中山市', '古镇', '顺康大道', '中山市祈富物理园',) : 9,
    ('广东省', '梅州市', '梅县', '程江镇车上村', '梅州龙达物流',) : 10,
    ('广东省', '广州市', '番禺区', '东环街道蔡边三村', '华圣物流园区',) : 11,
    ('广东省', '珠海市', '香洲区', '前山街道办界涌社区', '东顺物流园',) : 12,
    ('广东省', '东莞市', '南城区', '南城街道白马社区', '黄金物理园',) : 13,
    ('广东省', '湛江市', '麻章区', '康宁路', '湛江赤坎物流货运市场',) : 14,
    ('广东省', '阳江市', '阳东区', '东城镇丹载村', '阳江远成物流',) : 15,
    ('广东省', '汕头市', '金平区', '鮀江街道大学路', '通用物流市场',) : 16,
    ('湖北省', '武汉市', '白沙洲', '解放路', '白沙洲物流集散区',) : 17,
    ('广西省', '柳州市', '柳南区', '航生路', '上海新港物流集散区',) : 18,
    ('福建省', '漳州市', '龙海市', '颜厝镇路边村', '漳州桥南顺利物流园',) : 19,
    ('湖南省', '长沙市', '长沙县', '劳动中路', '中港（长沙）物流园',) : 20,
    ('江西省', '赣州市', '南康市', '龙岭镇向阳村', '邦大华宇物流',) : 21,
    ('江西省', '南昌市', '西湖区', '清流路', '心成物流',) : 22,
}

CODE_LOCATION = {
    1 : ('广东省', '深圳市', '罗湖区', '流塘路', '罗湖物流集散区',),
    2 : ('广东省', '深圳市', '龙岗区', '龙华民康路', '华南国际物流中心',),
    3 : ('广东省', '深圳市', '福田区', '市花路9号', '泰福物流',),
    4 : ('广东省', '深圳市', '龙岗区', '沙平北路', '金鹏物流园',),
    5 : ('广东省', '深圳市', '盐田区', '盐田街道明珠东南方向', '腾邦物流园',),
    6 : ('广东省', '深圳市', '宝安区', '松岗街道罗田社区', '远辉物理园',),
    7 : ('广东省', '深圳市', '宝安区', '石岩街道塘头社区', '宏源发石岩物流园',),
    8 : ('广西省', '南宁市', '江南区', '江南街道五一中路', '天马物流',),
    9 : ('广东省', '中山市', '古镇', '顺康大道', '中山市祈富物理园',),
    10 : ('广东省', '梅州市', '梅县', '程江镇车上村', '梅州龙达物流',),
    11 : ('广东省', '广州市', '番禺区', '东环街道蔡边三村', '华圣物流园区',),
    12 : ('广东省', '珠海市', '香洲区', '前山街道办界涌社区', '东顺物流园',),
    13 : ('广东省', '东莞市', '南城区', '南城街道白马社区', '黄金物理园',),
    14 : ('广东省', '湛江市', '麻章区', '康宁路', '湛江赤坎物流货运市场',),
    15 : ('广东省', '阳江市', '阳东区', '东城镇丹载村', '阳江远成物流',),
    16 : ('广东省', '汕头市', '金平区', '鮀江街道大学路', '通用物流市场',),
    17 : ('湖北省', '武汉市', '白沙洲', '解放路', '白沙洲物流集散区',),
    18 : ('广西省', '柳州市', '柳南区', '航生路', '上海新港物流集散区',),
    19 : ('福建省', '漳州市', '龙海市', '颜厝镇路边村', '漳州桥南顺利物流园',),
    20: ('湖南省', '长沙市', '长沙县', '劳动中路', '中港（长沙）物流园',),
    21 : ('江西省', '赣州市', '南康市', '龙岭镇向阳村', '邦大华宇物流',),
    22 : ('江西省', '南昌市', '西湖区', '清流路', '心成物流',),
}

def load_outter_data():
    pass
